In [1]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in c:\users\aayush\anaconda3\lib\site-packages (8.4.0)

In [2]:
import mysql.connector  		#importing database
database = mysql.connector.connect(
    host="localhost",
    user="root",
    password="",
   database = "python3pm")

db = database.cursor()

In [4]:
#read data from table
db.execute("SELECT * FROM student")
result =db.fetchall()
for x in result:
    print(x)

(1, 'Rama', 89, 97, 86, 67, 89, 420, 82.5, 'A')
(3, 'Nabin', 82, 84, 99, 98, 89, 430, 88.5, 'A')
(4, 'Shiva', 49, 57, 25, 98, 89, 400, 70.0, 'A')
(10, 'Sameer', 89, 67, 80, 98, 89, 412, 82.5, 'A')
(11, 'Rama', 89, 45, 65, 87, 78, 364, 72.8, 'B')
(12, 'Ram', 87, 90, 65, 78, 87, 407, 81.4, 'A')
(13, 'Gauri', 98, 78, 90, 87, 78, 431, 86.2, 'A')
(15, 'Hari', 78, 87, 99, 67, 65, 412, 85.0, 'A')
(40, 'Hari', 89, 89, 89, 78, 87, 412, 83.0, 'A')

In [4]:
sql = '''INSERT INTO student (sn, name, physics, chemistry, math, english, nepali, total, per, grade)
VALUES (24, 'Sajan', 89, 67, 98, 78, 89, 412, 80, 'A'); '''
db.execute(sql)
database.commit()

In [2]:
n = int(input("Enter n = "))
for i in range(1,n+1):
    name = input("Enter name = ")
    physics=int(input("Enter physics marks = "))
    chemistry=int(input("Enter chemistry marks = "))
    math=int(input("Enter math marks = "))
    english=int(input("Enter english marks = "))
    nepali=int(input("Enter nepali marks = "))
    
    total = physics + chemistry + math + english + nepali
    per = total/5
    if per >= 80:
        grade = 'A'
    elif per >= 60:
        grade = 'B'
    elif per >= 45:
        grade = 'C'
    elif per >= 32:
        grade = 'D'
    else:
        grade = 'F'

    sql = f'''INSERT INTO student (name, physics, chemistry, math, english, nepali, total, per, grade)
    VALUES ('{name}', {physics}, {chemistry}, {math}, {english}, {nepali}, {total}, {per}, '{grade}') '''
    db.execute(sql)
    
database.commit()

Enter n =  1
Enter name =  Akash
Enter physics marks =  89
Enter chemistry marks =  90
Enter math marks =  32
Enter english marks =  89
Enter nepali marks =  67

In [5]:
# Update
sql = '''UPDATE student SET per = 82.6 WHERE sn = 1'''
db.execute(sql)
database.commit()

In [ ]:
# delete
sql = "DELETE FROM student WHERE sn = 1"
db.execute(sql)
database.commit()